<?php

return [
    '2fa'      => 'ورود دو عاملی',
    'verify'   => 'تایید',
    'activate' => 'فعال سازی ورود دو عاملی',
    'code'     => 'رمز دو عاملی',
    'messages' => [
        'incorrect'       => 'رمز وارد شده اشتباه است.',
        'please-verify'   => 'لطفا تغییرات را تایید کنید.',
        'protected'       => 'اشتراک شما توسط رمز دو عاملی محافظت می شود.',
        'info'            => 'با کمک ورود دو عاملی حتی اگر فردی رمز عبور شما را داشته باشد باز هم دسترسی به اشتراک شما نخواهد داشت. <a href="https://www.youtube.com/watch?v=0mvCeNsTa1g" target="_blank">اطلاعات بیشتر</a>',
        'how-it-works'    => 'چگونه کار می کند',
        'when-logging-in' => 'در زمان ورود شما باید:',
        'step-1'          => 'رمز ورود را وارد کنید',
        'step-2'          => 'رمز عبور ایجاد شده با نرم افزار را وارد کنید',
        'activate'        => [
            'install-app'      => 'لطفا یکی از نرم افزار های تایید هویت را نصب کنید مثل:',
            'scan-qr'          => 'نرم افزار تایید هویت را نصب کنید و QR Code را اسکن کنید.',
            'key'              => 'نمی توانید QR Code را اسکن کنید؟<br />رمز عبور را وارد کنید.:',
            'enter-password'   => 'رمز عبور فعلی که با آن وارد شدید را بنویسید.',
            'current-password' => 'رمز فعلی',
            'step-1'           => 'نصب نرم افزار احراز هوبیت',
            'step-2'           => 'تنظیم نرم افزار',
            'step-3'           => 'وارد کردن رمز فعلی',
            'step-4'           => 'وارد کردن رمز 6 کلمه ای تولید شده',
        ],
    ],
];
